Samsung/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
static void _tizenrt_enter_critical(_lock *plock, _irqL *pirqL)
{
	save_and_cli();
}

static void _tizenrt_exit_critical(_lock *plock, _irqL *pirqL)
{
	restore_flags();
}

static void _tizenrt_enter_critical_from_isr(_lock *plock, _irqL *pirqL)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
}

static void _tizenrt_exit_critical_from_isr(_lock *plock, _irqL *pirqL)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
}

static int _tizenrt_enter_critical_mutex(_mutex *pmutex, _irqL *pirqL)
{
	int temp;
	temp = sem_wait(*pmutex);
	if (temp != 0) {
		DBG_ERR("_tizenrt_spinlock failed!\n");
	}
	return temp;
}

static void _tizenrt_exit_critical_mutex(_mutex *pmutex, _irqL *pirqL)
{
	sem_post(*pmutex);
}

#if defined(CONFIG_PLATFORM_8195BHP)
#include "timer_api.h"
static gtimer_t tmp_timer_obj;
#endif
static void _tizenrt_cpu_lock(void)
{
#if defined(CONFIG_PLATFORM_8195BHP)
	__disable_irq();
	icache_disable();
	dcache_disable();

	gtimer_init(&tmp_timer_obj, 0xff);
	gtimer_reload(&tmp_timer_obj, 400 * 1000);	// 4s
	gtimer_start(&tmp_timer_obj);
#endif
}

static void _tizenrt_cpu_unlock(void)
{
#if defined(CONFIG_PLATFORM_8195BHP)
	int duration = (int)gtimer_read_us(&tmp_timer_obj) / 1000;
	gtimer_deinit(&tmp_timer_obj);
	// compensate rtos tick
	vTaskIncTick(duration);
	icache_enable();
	icache_invalidate();
	__enable_irq();
#endif
}

static void _tizenrt_spinlock_init(_lock *plock)
{
	if (*plock == NULL) {
		*plock = _tizenrt_zmalloc(sizeof(sem_t));
		if (*plock == NULL) {
			ndbg("\r\n _tizenrt_spinlock_init failed \n");
			return;
		}
	}
	sem_init(*plock, 0, 1);
	sem_setprotocol(*plock, SEM_PRIO_NONE);
}

static void _tizenrt_spinlock_free(_lock *plock)
{
	int i;
	if (*plock != NULL) {
		i = sem_destroy(*plock);
		if (i == 0) {
			kmm_free(*plock);
		} else {
			ndbg("\r\n _tizenrt_spinlock_free fail!!! \n");
		}
	}
	*plock = NULL;
}

static void _tizenrt_spinlock(_lock *plock)
{
	int temp;
	temp = sem_wait(*plock);
	if (temp != 0) {
		DBG_ERR("_tizenrt_spinlock failed!\n");
	}
}

static void _tizenrt_spinunlock(_lock *plock)
{
	sem_post(*plock);
}

static void _tizenrt_spinlock_irqsave(_lock *plock, _irqL *irqL)
{

	int temp;
	__enable_irq();
	temp = pthread_mutex_lock(*plock);
	if (temp != 0) {
		DBG_ERR("_tizenrt_spinlock failed!\n");
	}
}

static void _tizenrt_spinunlock_irqsave(_lock *plock, _irqL *irqL)
{

	pthread_mutex_unlock(*plock);
	__disable_irq();
}

static int _tizenrt_init_xqueue(_xqueue *queue, const char *name, u32 message_size, u32 number_of_messages)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

static int _tizenrt_push_to_xqueue(_xqueue *queue, void *message, u32 timeout_ms)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

static int _tizenrt_pop_from_xqueue(_xqueue *queue, void *message, u32 timeout_ms)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

static int _tizenrt_deinit_xqueue(_xqueue *queue)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

static u32 _tizenrt_get_current_time(void)
{
	return (u32) clock();
}

static u32 _tizenrt_systime_to_ms(u32 sys_time)
{

	return (sys_time * 1000L / TICK_PER_SEC);
}

static u32 _tizenrt_systime_to_sec(u32 sys_time)
{

	return (sys_time / TICK_PER_SEC);
}

static u32 _tizenrt_ms_to_systime(u32 ms)
{

	return (ms * TICK_PER_SEC / 1000L);
}

static u32 _tizenrt_sec_to_systime(u32 sec)
{

	return (sec * TICK_PER_SEC);
}

static void _tizenrt_msleep_os(int ms)
{
	usleep((unsigned int)ms * 1000);
}

static void _tizenrt_usleep_os(int us)
{
	usleep((unsigned int)us);
}

static void _tizenrt_mdelay_os(int ms)
{
	up_mdelay((unsigned long)ms);
}

static void _tizenrt_udelay_os(int us)
{
	up_udelay((unsigned long)us);
}

static void _tizenrt_yield_os(void)
{
	sched_yield();
}

static void _tizenrt_ATOMIC_SET(ATOMIC_T *v, int i)
{
	atomic_set(v, i);
}

static int _tizenrt_ATOMIC_READ(ATOMIC_T *v)
{
	return atomic_read(v);
}

static void _tizenrt_ATOMIC_ADD(ATOMIC_T *v, int i)
{
	save_and_cli();
	v->counter += i;
	restore_flags();
}

static void _tizenrt_ATOMIC_SUB(ATOMIC_T *v, int i)
{
	save_and_cli();
	v->counter -= i;
	restore_flags();
}

static void _tizenrt_ATOMIC_INC(ATOMIC_T *v)
{
	_tizenrt_ATOMIC_ADD(v, 1);
}

static void _tizenrt_ATOMIC_DEC(ATOMIC_T *v)
{
	_tizenrt_ATOMIC_SUB(v, 1);
}

static int _tizenrt_ATOMIC_ADD_RETURN(ATOMIC_T *v, int i)
{
	int temp;

	save_and_cli();
	temp = v->counter;
	temp += i;
	v->counter = temp;
	restore_flags();

	return temp;
}

static int _tizenrt_ATOMIC_SUB_RETURN(ATOMIC_T *v, int i)
{
	int temp;

	save_and_cli();
	temp = v->counter;
	temp -= i;
	v->counter = temp;
	restore_flags();

	return temp;
}

static int _tizenrt_ATOMIC_INC_RETURN(ATOMIC_T *v)
{
	return _tizenrt_ATOMIC_ADD_RETURN(v, 1);
}

static int _tizenrt_ATOMIC_DEC_RETURN(ATOMIC_T *v)
{
	return _tizenrt_ATOMIC_SUB_RETURN(v, 1);
}

static u64 _tizenrt_modular64(u64 n, u64 base)
{
	unsigned int __base = (base);
	unsigned int __rem;

	if (((n) >> 32) == 0) {
		__rem = (unsigned int)(n) % __base;
		(n) = (unsigned int)(n) / __base;
	} else {
		__rem = __div64_32(&(n), __base);
	}

	return __rem;
}

/* Refer to ecos bsd tcpip codes */
static int _tizenrt_arc4random(void)
{
#if defined(CONFIG_PLATFORM_8721D)
	int value = (int)Rand();
	return value;

#else
	u32 res = xTaskGetTickCount();
	static unsigned long seed = 0xDEADB00B;

#if defined(CONFIG_PLATFORM_8711B)
	if (random_seed) {
		seed = random_seed;
		random_seed = 0;
	}
#endif

	seed = ((seed & 0x007F00FF) << 7) ^ ((seed & 0x0F80FF00) >> 8) ^	// be sure to stir those low bits
		   (res << 13) ^ (res >> 9);	// using the clock too!
	return (int)seed;
#endif
}

static int _tizenrt_get_random_bytes(void *buf, size_t len)
{
	unsigned int ranbuf;
	unsigned int *lp;
	int i, count;
	count = len / sizeof(unsigned int);
	lp = (unsigned int *)buf;

	for (i = 0; i < count; i++) {
		lp[i] = _tizenrt_arc4random();
		len -= sizeof(unsigned int);
	}

	if (len > 0) {
		ranbuf = _tizenrt_arc4random();
		_tizenrt_memcpy(&lp[i], &ranbuf, len);
	}
	return 0;
}

static u32 _tizenrt_GetFreeHeapSize(void)
{
	return 0;
}

void *tcm_heap_malloc(int size);
extern int debug_steps;
static int _tizenrt_create_task(struct task_struct *ptask, const char *name, u32 stack_size, u32 priority, thread_func_t func, void *thctx)
{
	pthread_attr_t attr;
	struct sched_param sparam;
	int res = 0;

	pthread_t *tid = _tizenrt_zmalloc(sizeof(pthread_t));
	if (tid == NULL) {
		DBG_ERR("Failed to malloc for tid\n");
		goto err_exit;
	}

	res = pthread_attr_init(&attr);
	if (res != OK) {
		DBG_ERR("Failed to pthread_attr_init\n");
		goto err_exit;
	}

	stack_size *= sizeof(uint32_t);
	res = pthread_attr_setstacksize(&attr, stack_size);
	if (res != OK) {
		DBG_ERR("Failed to pthread_attr_setstacksize\n");
		goto err_exit;
	}

