Samsung/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
	sparam.sched_priority = PTHREAD_DEFAULT_PRIORITY + priority;

	res = pthread_attr_setschedparam(&attr, &sparam);
	if (res != OK) {
		DBG_ERR("Failed to pthread_attr_setstacksize\n");
		goto err_exit;
	}

	res = pthread_create(tid, &attr, (pthread_startroutine_t) func, thctx);
	if (res != OK) {
		DBG_ERR("Failed to pthread_create\n");
		goto err_exit;
	}
	if (*tid == 0) {
		DBG_ERR("create the task %s failed!", name);
		goto err_exit;
	}
	ptask->task = tid;
	ptask->task_name = name;
	return _SUCCESS;
err_exit:
	if (tid) {
		_tizenrt_mfree(tid, sizeof(*tid));
	}
	ptask->task = NULL;
	ptask->task_name = NULL;
	return _FAIL;
}

static void _tizenrt_delete_task(struct task_struct *ptask)
{
	int status = 0;
	pthread_t *tid = (pthread_t *) ptask->task;
	if (!ptask->task || *tid == 0) {
		DBG_ERR("_tizenrt_delete_task(): ptask is NULL %s!\n", ptask->task_name);
		return;
	}
	//status = task_delete(ptask->task); //TODO
	status = pthread_cancel(*tid);
	if (status != OK) {
		DBG_ERR("delete the task failed!", ptask->task_name);
		return;
	}
	_tizenrt_mfree(tid, sizeof(*tid));
	ptask->task = NULL;
	return;
}

void _tizenrt_wake_task(struct task_struct *task)
{
	sem_post(task->wakeup_sema);
	return;
}

static void _tizenrt_thread_enter(char *name)
{
	DBG_INFO("\n\rRTKTHREAD %s\n", name);
}

static void _tizenrt_thread_exit(void)
{
	DBG_INFO("\n\rRTKTHREAD exit %s\n", __FUNCTION__);
	pthread_exit(NULL);
	//task_delete(0);
}

_timerHandle _tizenrt_timerCreate(const signed char *pcTimerName, osdepTickType xTimerPeriodInTicks, u32 uxAutoReload, void *pvTimerID, TIMER_FUN pxCallbackFunction)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)_tizenrt_zmalloc(sizeof(struct timer_list_priv));
	if (timer == NULL) {
		DBG_ERR("Fail to alloc priv");
		//rtw_timerDelete(timer, TIMER_MAX_DELAY);
		//timer->timer_hdl = NULL;
		return NULL;
	}
	timer->work_hdl = (struct work_s *)_tizenrt_zmalloc(sizeof(struct work_s));
	if (timer->work_hdl == NULL) {
		DBG_ERR("Fail to alloc timer->work_hdl");
		//_tizenrt_timerDelete(timer, TIMER_MAX_DELAY);
		//timer->timer_hdl = NULL;
		kmm_free(timer);
		return NULL;
	}
	timer->live = 0;
	timer->timevalue = xTimerPeriodInTicks;
	timer->data = pvTimerID;
	timer->function = pxCallbackFunction;
	return (_timerHandle) timer;
}

u32 _tizenrt_timerDelete(_timerHandle xTimer, osdepTickType xBlockTime)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	int ret = work_cancel(LPWORK, timer->work_hdl);
	if (ret != OK) {
		goto cleanup;
	}
	timer->data = NULL;
	timer->timer_hdl = NULL;
	timer->timevalue = 0;
	timer->live = 0;
	kmm_free(timer->work_hdl);
	kmm_free(timer);
	return _SUCCESS;

cleanup:
	if (ret != -2) {
		timer->data = NULL;
		timer->timer_hdl = NULL;
		timer->timevalue = 0;
		timer->live = 0;
		kmm_free(timer->work_hdl);
		kmm_free(timer);
		DBG_ERR("_tizenrt_del_timer failed! ret = %d", ret);
		return _FAIL;
	}
	timer->data = NULL;
	timer->timer_hdl = NULL;
	timer->timevalue = 0;
	timer->live = 0;
	kmm_free(timer->work_hdl);
	kmm_free(timer);
	//DBG_ERR("_tizenrt_del_timer is Done! timer->work_hdl = %x", timer->work_hdl);
	return _SUCCESS;
}

u32 _tizenrt_timerIsTimerActive(_timerHandle xTimer)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	return timer->live;
	//return (timer->work_hdl->worker != NULL);
}

u32 _tizenrt_timerStop(_timerHandle xTimer, osdepTickType xBlockTime)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	int ret = work_cancel(LPWORK, timer->work_hdl);
	if (ret != OK) {
		goto cleanup;
	}
	timer->timevalue = 0;
	timer->live = 0;
	return _SUCCESS;

cleanup:
	if (ret != -2) {
		kmm_free(timer->work_hdl);
		kmm_free(timer);
		DBG_ERR("_tizenrt_stop_timer failed! ret = %d", ret);
		return _FAIL;
	}
	timer->timevalue = 0;
	timer->live = 0;
	DBG_ERR("_tizenrt_stop_timer is Done! timer->work_hdl = %x", timer->work_hdl);
	return _SUCCESS;
}

u32 _tizenrt_timerChangePeriod(_timerHandle xTimer, osdepTickType xNewPeriod, osdepTickType xBlockTime)
{
	int ret;
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	ret = work_queue(LPWORK, timer->work_hdl, timer->function, (void *)(timer), xNewPeriod);
	if (ret == -EALREADY) {
		if (work_cancel(LPWORK, timer->work_hdl) != OK) {
			goto cleanup;
		}
		if (work_queue(LPWORK, timer->work_hdl, timer->function, (void *)(timer), xNewPeriod)) {
			goto cleanup;
		}
	}
	return _SUCCESS;

cleanup:
	kmm_free(timer->work_hdl);
	timer->timer_hdl = NULL;
	timer->live = 0;
	kmm_free(timer);
	DBG_ERR("_tizenrt_set_timer failed!");
	return _FAIL;
}

void *_tizenrt_timerGetID(_timerHandle xTimer)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	return timer->data;
}

u32 _tizenrt_timerStart(_timerHandle xTimer, osdepTickType xBlockTime)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerStartFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerStopFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerResetFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerChangePeriodFromISR(_timerHandle xTimer, osdepTickType xNewPeriod, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerReset(_timerHandle xTimer, osdepTickType xBlockTime)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

void _tizenrt_acquire_wakelock(void)
{
}

void _tizenrt_release_wakelock(void)
{
}

void _tizenrt_wakelock_timeout(uint32_t timeout)
{
}

u8 _tizenrt_get_scheduler_state(void)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

const struct osdep_service_ops osdep_service = {
	_tizenrt_malloc,			//rtw_vmalloc
	_tizenrt_zmalloc,			//rtw_zvmalloc
	_tizenrt_mfree,				//rtw_vmfree
	_tizenrt_malloc,			//rtw_malloc
	_tizenrt_zmalloc,			//rtw_zmalloc
	_tizenrt_mfree,				//rtw_mfree
	_tizenrt_memcpy,			//rtw_memcpy
	_tizenrt_memcmp,			//rtw_memcmp
	_tizenrt_memset,			//rtw_memset
	_tizenrt_init_sema,			//rtw_init_sema
	_tizenrt_free_sema,			//rtw_free_sema
	_tizenrt_up_sema,			//rtw_up_sema
	_tizenrt_up_sema_from_isr,	//rtw_up_sema_from_isr
	_tizenrt_down_sema,			//rtw_down_sema
	_tizenrt_mutex_init,		//rtw_mutex_init
	_tizenrt_mutex_free,		//rtw_mutex_free
	_tizenrt_mutex_get,			//rtw_mutex_get
	_tizenrt_mutex_get_timeout,	//rtw_mutex_get_timeout
	_tizenrt_mutex_put,			//rtw_mutex_put
	_tizenrt_enter_critical,	//rtw_enter_critical
	_tizenrt_exit_critical,		//rtw_exit_critical
	_tizenrt_enter_critical_from_isr,	//rtw_enter_critical_from_isr
	_tizenrt_exit_critical_from_isr,	//rtw_exit_critical_from_isr
	NULL,						//rtw_enter_critical_bh
	NULL,						//rtw_exit_critical_bh
	_tizenrt_enter_critical_mutex,	//rtw_enter_critical_mutex
	_tizenrt_exit_critical_mutex,	//rtw_exit_critical_mutex
	NULL,						//rtw_suspend_task
	NULL,						//rtw_resume_task
	_tizenrt_spinlock_init,		//rtw_spinlock_init
	_tizenrt_spinlock_free,		//rtw_spinlock_free
	_tizenrt_spinlock,			//rtw_spin_lock
	_tizenrt_spinunlock,		//rtw_spin_unlock
	_tizenrt_spinlock_irqsave,	//rtw_spinlock_irqsave
	_tizenrt_spinunlock_irqsave,	//rtw_spinunlock_irqsave
	_tizenrt_init_xqueue,		//rtw_init_xqueue
	_tizenrt_push_to_xqueue,	//rtw_push_to_xqueue
	_tizenrt_pop_from_xqueue,	//rtw_pop_from_xqueue
	_tizenrt_deinit_xqueue,		//rtw_deinit_xqueue
	_tizenrt_get_current_time,	//rtw_get_current_time
	_tizenrt_systime_to_ms,		//rtw_systime_to_ms
	_tizenrt_systime_to_sec,	//rtw_systime_to_sec
	_tizenrt_ms_to_systime,		//rtw_ms_to_systime
	_tizenrt_sec_to_systime,	//rtw_sec_to_systime
	_tizenrt_msleep_os,			//rtw_msleep_os
	_tizenrt_usleep_os,			//rtw_usleep_os
	_tizenrt_mdelay_os,			//rtw_mdelay_os
	_tizenrt_udelay_os,			//rtw_udelay_os
	_tizenrt_yield_os,			//rtw_yield_os

