Samsung/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
	_tizenrt_ATOMIC_SET,		//ATOMIC_SET
	_tizenrt_ATOMIC_READ,		//ATOMIC_READ
	_tizenrt_ATOMIC_ADD,		//ATOMIC_ADD
	_tizenrt_ATOMIC_SUB,		//ATOMIC_SUB
	_tizenrt_ATOMIC_INC,		//ATOMIC_INC
	_tizenrt_ATOMIC_DEC,		//ATOMIC_DEC
	_tizenrt_ATOMIC_ADD_RETURN,	//ATOMIC_ADD_RETURN
	_tizenrt_ATOMIC_SUB_RETURN,	//ATOMIC_SUB_RETURN
	_tizenrt_ATOMIC_INC_RETURN,	//ATOMIC_INC_RETURN
	_tizenrt_ATOMIC_DEC_RETURN,	//ATOMIC_DEC_RETURN

	_tizenrt_modular64,			//rtw_modular64
	_tizenrt_get_random_bytes,	//rtw_get_random_bytes
	_tizenrt_GetFreeHeapSize,	//rtw_getFreeHeapSize

	_tizenrt_create_task,		//rtw_create_task
	_tizenrt_delete_task,		//rtw_delete_task
	_tizenrt_wake_task,			//rtw_wakeup_task
	NULL,
	NULL,

	_tizenrt_thread_enter,		//rtw_thread_enter
	_tizenrt_thread_exit,		//rtw_thread_exit

	_tizenrt_timerCreate,		//rtw_timerCreate,
	_tizenrt_timerDelete,		//rtw_timerDelete,
	_tizenrt_timerIsTimerActive,	//rtw_timerIsTimerActive,
	_tizenrt_timerStop,			//rtw_timerStop,
	_tizenrt_timerChangePeriod,	//rtw_timerChangePeriod
	_tizenrt_timerGetID,		//rtw_timerGetID
	_tizenrt_timerStart,		//rtw_timerStart
	_tizenrt_timerStartFromISR,	//rtw_timerStartFromISR
	_tizenrt_timerStopFromISR,	//rtw_timerStopFromISR
	_tizenrt_timerResetFromISR,	//rtw_timerResetFromISR
	_tizenrt_timerChangePeriodFromISR,	//rtw_timerChangePeriodFromISR
	_tizenrt_timerReset,		//rtw_timerReset

	_tizenrt_acquire_wakelock,	//rtw_acquire_wakelock
	_tizenrt_release_wakelock,	//rtw_release_wakelock
	_tizenrt_wakelock_timeout,	//rtw_wakelock_timeout
	_tizenrt_get_scheduler_state,	//rtw_get_scheduler_state
	NULL,						// rtw_create_secure_context
	NULL,						//rtw_get_current_TaskHandle
};

static IRQ_FUN TizenUserIrqFunTable[MAX_PERIPHERAL_IRQ_NUM];
static int wrapper_IrqFun(int irq, FAR void *context, FAR void *arg)
{
	if (irq < AMEBAD_IRQ_FIRST) {
		DiagPrintf("INT %d should not come here\r\n", irq);
		return OK;
	}
	__NVIC_ClearPendingIRQ(irq - AMEBAD_IRQ_FIRST);
	if (TizenUserIrqFunTable[irq - AMEBAD_IRQ_FIRST] != NULL) {
		TizenUserIrqFunTable[irq - AMEBAD_IRQ_FIRST]((VOID *)(arg));
	} else {
		DiagPrintf("INT_Entry Irq %d Fun Not Assign!!!!!", irq - AMEBAD_IRQ_FIRST);
	}
	return OK;
}

BOOL irq_register(IRQ_FUN IrqFun, IRQn_Type IrqNum, u32 Data, u32 Priority)
{
	if (IrqNum < 0) {
		DiagPrintf("INT %d should not come here\r\n", IrqNum);
		return _TRUE;
	}
	Priority = (Priority >> IRQ_PRIORITY_SHIFT);
	if (IrqNum == WL_DMA_IRQ || IrqNum == WL_PROTOCOL_IRQ) {
		Priority = 4;
	}
	TizenUserIrqFunTable[IrqNum] = (IRQ_FUN)((u32) IrqFun | 0x1);
	Priority = (Priority << (8 - __NVIC_PRIO_BITS));
	irq_attach(IrqNum + AMEBAD_IRQ_FIRST, wrapper_IrqFun, (void *)Data);
	up_prioritize_irq(IrqNum + AMEBAD_IRQ_FIRST, Priority);	//Need to fix, because it can't get the same result as __NVIC_SetPriority
	return _TRUE;
}

BOOL irq_unregister(IRQn_Type IrqNum)
{
	if (IrqNum < 0) {
		DiagPrintf("INT %d should not come here\r\n", IrqNum);
		return _TRUE;
	}
	irq_detach(IrqNum);
	TizenUserIrqFunTable[IrqNum] = NULL;
	return _TRUE;
}

void irq_enable(IRQn_Type IrqNum)
{
	if (IrqNum < 0) {
		DiagPrintf("INT %d should not come here\r\n", IrqNum);
		return;
	}
	up_enable_irq(IrqNum + AMEBAD_IRQ_FIRST);
}

void irq_disable(IRQn_Type IrqNum)
{
	if (IrqNum < 0) {
		DiagPrintf("INT %d should not come here\r\n", IrqNum);
		return;
	}
	up_disable_irq(IrqNum + AMEBAD_IRQ_FIRST);
}

int __wrap_printf(const char *format, ...)
{
	int ret = 0;
	va_list args;
	va_start(args, (const char *)format);
	ret = DiagPrintf((const char *)format, args);
	va_end(args);
	return ret;
}

void shell_switch_ipc_int(VOID *Data, u32 IrqStatus, u32 ChanNum)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
}

uint32_t *vTaskStackAddr(void)
{
	return NULL;
}

uint32_t vTaskStackSize(void)
{
	return 0;
}

void vPortEnterCritical(void)
{
	save_and_cli();
}

void vPortExitCritical(void)
{
	restore_flags();
}
